{
  "name": {
    "male": [
      "James",
      "John",
      "Robert",
      "Michael",
      "William"
    ],
    "female": [
      "Mary",
      "Jenny",
      "Elizabeth",
      "Jennifer",
      "Sarah"
    ]
  },
  "age": [
    "18",
    "24",
    "28",
    "32",
    "38",
    "46",
    "52"
  ],
  "symptoms": [
    {
      "type": "open",
      "positive": [
      ],
      "negative": [
      ]
    },
    {
      "type": "age",
      "positive": [
      ],
      "negative": [
      ]
    },
	{
      "type": "name",
      "positive": [
      ],
      "negative": [
      ]
    },
    {
      "type": "cough",
      "positive": [
        "I've had a slight cough for the last few weeks.",
        "Yeah I have been coughing a lot lately.",
        "Yes, I have been coughing. I was hoping it would fade, instead it has been getting worse."
      ],
      "negative": [
        "No, I have not been coughing."
      ]
    },
    {
      "type": "fever",
      "positive": [
        "I have been feeling kind of hot.",
        "My forehead does feel kind of hot.",
        "I think I do have a slight fever."
      ],
      "negative": [
        "No, I do not have a fever."
      ]
    },
    {
      "type": "night_sweats",
      "positive": [
        "Some nights I wake up with soaked in my nightclothes.",
        "Yes, though my bedroom is always kept at a 70 degrees.",
        "I have noticed that I've been sweating a lot and I don't think it's because I'm sleeping under too many blankets."
      ],
      "negative": [
        "No, I have not experienced night sweats."
      ]
    },
    {
      "type": "weight_loss",
      "positive": [
        "Yeah, at least I'm not gaining weight :).",
        "I'm glad you noticed :).",
        "Thank you for the complement."
      ],
      "negative": [
        "No, I've maintained the same weight."
      ]
    },
    {
      "type": "loss_of_appetite",
      "positive": [
        "I have skipped a few meals, sometimes I just don't feel hungry",
        "I've had some difficulty finishing my meals. I just don't feel hungry.",
        "Yeah, I'm not eating as much now."
      ],
      "negative": [
        "No, I've my eating habits have not changed."
      ]
    },
    {
      "type": "headache",
      "positive": [
        "Yeah, I've been having random headache.",
        "Now that you mention it, I have been experiencing headaches throughout the day.",
        "Yes, a few headaches here and there."
      ],
      "negative": [
        "No, I have not had a headache recently."
      ]
    },
    {
      "type": "tiredness",
      "positive": [
        "Yeah, I have been feeling kind of tired. Maybe I'm getting old.",
        "Yes, some days I come home from work and immediately go to bed.",
        "I do feel like I don't have as much energy as I use to."
      ],
      "negative": [
        "No, I have not been feeling fatigued lately."
      ]
    },
    {
      "type": "joint_pain",
      "positive": [
        "Yeah, I've been having pain in my joints. I didn't read into it too much. I just assumed it would go away.",
        "Now that you mention it, I have been experiencing some pain in my joints in the last few days.",
        "Yes, I've been have some joint pain."
      ],
      "negative": [
        "No, I have not had any pain in my joints recently."
      ]
    },
    {
      "type": "muscle_weakness",
      "positive": [
        "Yeah, my muscles have been feeling sore.",
        "Now that you mention it, I have been experiencing weakness in my muscles throughout the day.",
        "Yes, a few aches here and there."
      ],
      "negative": [
        "No, I have not had any weakness in my muscles recently."
      ]
    },
    {
      "type": "red_skin",
      "positive": [
        "Yeah, I have some patches on my arms.",
        "Yes, I've recently noticed some red patches on my body.",
        "Yes, a few red patches here and there."
      ],
      "negative": [
        "No, I do have any red patches on my body."
      ]
    }
  ],
  "diseases": [
    {
      "type": "tuberculosis",
      "open": [
        "I think I might have the cold or flu. I've been taking over-the-counter medication, but it's not doing much. I've been drinking a lot of fluids, but it's difficult to have a full meal."
      ]
    }
  ]
}
